Catalogs/ЭтапыКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ЭтапыКонтрактов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КонтрактыИсполнителей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭтаповКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифноеРегулирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыРаботыУслугиСТарифнымРегулированием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыКонтрактов/Ext/ManagerModule.bsl
Функция СуммаЭтаповКонтракта(Владелец, ТипыЭтапов = Неопределено) Экспорт
	СуммаЭтаповКонтракта = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭтапыКонтрактов.Владелец,
	|	СУММА(ЭтапыКонтрактов.СуммаОплаты) КАК Сумма
	|ИЗ
	|	Справочник.ЭтапыКонтрактов КАК ЭтапыКонтрактов
	|ГДЕ
	|	ЭтапыКонтрактов.Владелец = &Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыКонтрактов.Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Если ТипЗнч(ТипыЭтапов) = Тип("Массив") 
		Или ТипЗнч(ТипыЭтапов) = Тип("ПеречислениеСсылка.ТипыЭтаповКонтрактов") Тогда
		Запрос.Текст = Запрос.Текст + "И ЭтапыКонтрактов.ТипЭтапа В (&ТипыЭтапов)";
		Запрос.УстановитьПараметр("ТипыЭтапов", ТипыЭтапов);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СуммаЭтаповКонтракта = Выборка.Сумма;
	КонецЕсли;
	
	Возврат СуммаЭтаповКонтракта;
КонецФункции
